<h2>建立一個學生成績陣列</h2>

<?php
 

 $subject=['國文','英文','數學','地理','歷史'];
 $judy=['95','64','70','90','84'];
 $amo=['95','64','70','90','84'];
 $john=['95','64','70','90','84'];
 $peter=['95','64','70','90','84'];
 $hebe=['95','64','70','90','84'];
 
 $avg=($judy[0]+$amo[0]+$john[0]+$peter[0]+$hebe[0])/5;
 
 echo $avg;
 
 
 $students=
 
 

$students=['國文'=>[
    '姓名'=>'judy',
    '成績'=>95
],
[
    '姓名'=>'amo',
    '成績'=>88
],
[
    '姓名'=>'john',
    '成績'=>45
],
[
    '姓名'=>'peter',
    '成績'=>59
],
[
    '姓名'=>'hebe',
    '成績'=>71
],
'英文'=>[
    '姓名'=>'judy',
    '成績'=>95
],
[
    '姓名'=>'amo',
    '成績'=>88
],
[
    '姓名'=>'john',
    '成績'=>45
],
[
    '姓名'=>'peter',
    '成績'=>59
],
[
    '姓名'=>'hebe',
    '成績'=>71
],
'數學'=>[
    '姓名'=>'judy',
    '成績'=>95
],
[
    '姓名'=>'amo',
    '成績'=>88
],
[
    '姓名'=>'john',
    '成績'=>45
],
[
    '姓名'=>'peter',
    '成績'=>59
],
[
    '姓名'=>'hebe',
    '成績'=>71
],
'地理'=>[
    '姓名'=>'judy',
    '成績'=>95
],
[
    '姓名'=>'amo',
    '成績'=>88
],
[
    '姓名'=>'john',
    '成績'=>45
],
[
    '姓名'=>'peter',
    '成績'=>59
],
[
    '姓名'=>'hebe',
    '成績'=>71
],
'歷史'=>[
    '姓名'=>'judy',
    '成績'=>95
],
[
    '姓名'=>'amo',
    '成績'=>88
],
[
    '姓名'=>'john',
    '成績'=>45
],
[
    '姓名'=>'peter',
    '成績'=>59
],
[
    '姓名'=>'hebe',
    '成績'=>71
],
];

echo "<pre>";
print_r($students);
echo"</pre>";